app/controllers/users_controller.rb

  def create
  	puts params
  	@user = User.new
  	@user.username = params["first_name"]
  	@user.email = params["email"]
  	@user.bio = params["bio"]
  	@user.save
  	@name = User.last.username
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "ghfd"], ["email", "lkjh"], ["bio", "ml!k:j"], ["created_at", "2018-10-30 18:44:54.068834"], ["updated_at", "2018-10-30 18:44:54.068834"]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]